w6d4/first_routes/app/controllers/users_controller.rb

INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "Geodude"]]
---
    def create

        user = User.new(user_params)
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "mona lisa"], ["id", 42]]
---
    def update
        user = User.find_by(id: params[:id])

        if user.update(user_params)