w6d3/first_routes/app/controllers/users_controller.rb

    def create
        # @user = User.new(params)
        # @user.id = User.first.id

        # if @user.save
        #     redirect_to user_url(@user)
        # else
        #     render json: @user.errors.full_messages, status: 422
        # end
        # render json: params

        @user = User.new(params.require(:user).permit(:name, :email))
        # replace the `user_attributes_here` with the actual attribute keys
        # user.save!
        if @user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Dora"], ["email", "boots@gmail.com"]]